# <center>Home work Pandas 1</center>

**By Lialin Maxim**

In [1]:
import pandas as pd

print( 'pandas version: ', pd.__version__)

pandas version:  1.3.5

In [2]:
df = pd.read_csv('adult.data.csv')
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

**1. Сколько мужчин и женщин (признак *sex*) представлено в этом наборе данных?**

In [3]:
df['sex'].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

**2. Каков средний возраст (признак *age*) женщин?**

In [4]:
df.groupby(['sex']).mean()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
sex,,,,,,
Female,36.858230,185746.311206,10.035744,568.410547,61.187633,36.410361
Male,39.433547,191771.449013,10.102891,1329.370078,100.213309,42.428086

In [5]:
df.groupby(['sex']).mean()['age']['Female']

36.85823043357163

**3. Какова доля граждан Германии (признак *native-country*)?**

In [6]:
df['native-country'].value_counts(normalize=True)

United-States                 0.895857
Mexico                        0.019748
?                             0.017905
Philippines                   0.006081
Germany                       0.004207
Canada                        0.003716
Puerto-Rico                   0.003501
El-Salvador                   0.003255
India                         0.003071
Cuba                          0.002918
England                       0.002764
Jamaica                       0.002488
South                         0.002457
China                         0.002303
Italy                         0.002242
Dominican-Republic            0.002150
Vietnam                       0.002058
Guatemala                     0.001966
Japan                         0.001904
Poland                        0.001843
Columbia                      0.001812
Taiwan                        0.001566
Haiti                         0.001351
Iran                          0.001321
Portugal                      0.001136
Nicaragua                     0.001044
Peru                          0.000952
France                        0.000891
Greece                        0.000891
Ecuador                       0.000860
Ireland                       0.000737
Hong                          0.000614
Cambodia                      0.000584
Trinadad&Tobago               0.000584
Laos                          0.000553
Thailand                      0.000553
Yugoslavia                    0.000491
Outlying-US(Guam-USVI-etc)    0.000430
Honduras                      0.000399
Hungary                       0.000399
Scotland                      0.000369
Holand-Netherlands            0.000031
Name: native-country, dtype: float64

In [7]:
df['native-country'].value_counts(normalize=True)['Germany']

0.004207487485028101

** 4-5. Каковы средние значения и среднеквадратичные отклонения возраста тех, кто получает более 50K в год (признак *salary*) и тех, кто получает менее 50K в год? **

In [8]:
df[df['salary'] == '>50K'].describe()['age']

count    7841.000000
mean       44.249841
std        10.519028
min        19.000000
25%        36.000000
50%        44.000000
75%        51.000000
max        90.000000
Name: age, dtype: float64

In [9]:
df[df['salary'] != '>50K'].describe()['age'][['std', 'mean']]

std     14.020088
mean    36.783738
Name: age, dtype: float64

**6. Правда ли, что люди, которые получают больше 50k, имеют как минимум высшее образование? (признак *education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters* или *Doctorate*)**

In [10]:
df[df['salary'] != '>50K'].groupby('education').count()['salary']

education
10th             871
11th            1115
12th             400
1st-4th          162
5th-6th          317
7th-8th          606
9th              487
Assoc-acdm       802
Assoc-voc       1021
Bachelors       3134
Doctorate        107
HS-grad         8826
Masters          764
Preschool         51
Prof-school      153
Some-college    5904
Name: salary, dtype: int64

**7. Выведите статистику возраста для каждой расы (признак *race*) и каждого пола. Используйте *groupby* и *describe*. Найдите таким образом максимальный возраст мужчин расы *Amer-Indian-Eskimo*.**

In [11]:
df[['race', 'age']].groupby('race').describe()

                        age                                                \
                      count       mean        std   min   25%   50%   75%
race
Amer-Indian-Eskimo    311.0  37.173633  12.447130  17.0  28.0  35.0  45.5
Asian-Pac-Islander   1039.0  37.746872  12.825133  17.0  28.0  36.0  45.0
Black                3124.0  37.767926  12.759290  17.0  28.0  36.0  46.0
Other                 271.0  33.457565  11.538865  17.0  25.0  31.0  41.0
White               27816.0  38.769881  13.782306  17.0  28.0  37.0  48.0


                     max
race
Amer-Indian-Eskimo  82.0
Asian-Pac-Islander  90.0
Black               90.0
Other               77.0
White               90.0

In [12]:
df[['race', 'age']].groupby('race').describe()[('age', 'max')]['Amer-Indian-Eskimo']

82.0

**8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак *marital-status*)? Женатыми считаем тех, у кого *marital-status* начинается с *Married* (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми.**

In [13]:
df_marital = df[
    (df['salary'] == '>50K') & (df['sex'] == 'Male')
].groupby(['marital-status']).count().sort_values('marital-status')['age'].to_frame().rename(columns={"age": "count"})

In [14]:
df_marital['persent %'] = (100. * df_marital / df_marital.sum()).round(1)

In [15]:
df_marital

                       count  persent %
marital-status
Divorced                 284        4.3
Married-AF-spouse          4        0.1
Married-civ-spouse      5938       89.1
Married-spouse-absent     23        0.3
Never-married            325        4.9
Separated                 49        0.7
Widowed                   39        0.6

**9. Какое максимальное число часов человек работает в неделю (признак *hours-per-week*)? Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?**

In [16]:
df['hours-per-week'].max()

99

In [17]:
df_hours = df.groupby(['hours-per-week', 'salary']).count().rename(columns={"age": "count"})['count']
df_htop = df_hours[df['hours-per-week'].max()].to_frame() 
df_htop['persent %'] = (100. * df_htop / df_htop.sum()).round(1)
df_htop

        count  persent %
salary
<=50K      60       70.6
>50K       25       29.4

**10. Посчитайте среднее время работы (*hours-per-week*) зарабатывающих мало и много (*salary*) для каждой страны (*native-country*).**

In [18]:
df_cuntry = df.groupby(['native-country', 'salary']).mean()['hours-per-week'].to_frame().round(1)
df_cuntry

                       hours-per-week
native-country salary
?              <=50K             40.2
               >50K              45.5
Cambodia       <=50K             41.4
               >50K              40.0
Canada         <=50K             37.9
...                               ...
United-States  >50K              45.5
Vietnam        <=50K             37.2
               >50K              39.2
Yugoslavia     <=50K             41.6
               >50K              49.5

[82 rows x 1 columns]

In [19]:
df_country.sort_values('hours-per-week').T

NameError: name 'df_country' is not defined

In [ ]:
df_country.groupby(['native-country']).describe()[[
 ('hours-per-week', 'mean'),
 ('hours-per-week', 'std'),
 ('hours-per-week', 'min'),
 ('hours-per-week', 'max')
]]